app/controllers/books_controller.rb

  def index
    render json: Book.all # TODO: Sort books by rating (high first) and then by publication date (soonest first).
  end
---
SELECT "books".* FROM "books"

  def create
    book = Book.new(book_params)
    if book.save
---
INSERT INTO "books" ("title", "author", "publication_date", "rating", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def show
    book = Book.find(params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 99], ["LIMIT", 1]]